blogs/tcp-keepalive-howto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>TCP Keepalive HOWTO</title>
<!-- 2015-09-27 日 13:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fabio Busatto, zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">TCP Keepalive HOWTO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 简介</a></li>
<li><a href="#sec-2">2. TCP Keepalive 概览</a>
<ul>
<li><a href="#sec-2-1">2.1. 什么是TCP Keepalive？</a></li>
<li><a href="#sec-2-2">2.2. 为什么使用TCP Keepalive？</a></li>
<li><a href="#sec-2-3">2.3. 检查无效连接</a></li>
<li><a href="#sec-2-4">2.4. 防止网络不活跃导致连接断开</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Linux 下如何使用TCP Keepalive</a>
<ul>
<li><a href="#sec-3-1">3.1. 配置内核</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. <b>procfs</b> 接口</a></li>
<li><a href="#sec-3-1-2">3.1.2. <code>sysctl</code> 接口</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. 使修改持久化</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 应用编程</a>
<ul>
<li><a href="#sec-4-1">4.1. 何时需要keepalive支持</a></li>
<li><a href="#sec-4-2">4.2. <code>setsockopt</code> 函数调用</a></li>
<li><a href="#sec-4-3">4.3. 实例代码</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 给第三方软件添加keepalive支持</a>
<ul>
<li><a href="#sec-5-1">5.1. 修改源码</a></li>
<li><a href="#sec-5-2">5.2. 使用libkeepalive</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 简介<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">
<p>
理解TCP Keepalive并非必须，但特定场景它非常有用，阅读本文需要基本的TCP/IP网络知识，基本的C语言知识。
</p>

<p>
本文的目的在于描述TCP Keepalive的细节，演示不同的应用场景。一些理论之后，给出配置的例子和技巧。
</p>

<p>
第二部分，讲述内核提供的编程接口，C语言如何编程启用Keepalive。除了实用的例子，还会介绍 <b>libkeepalive</b> 项目，它可以在不修改代码的情况下，让遗留应用启用Keepalive。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> TCP Keepalive 概览</h2>
<div class="outline-text-2" id="text-2">
<p>
如其名所示，TCP Keepalive（常常简称做Keepalive）的作用是，Keep TCP alive。这意味着你可以检查连接的socket（TCP socket），看它是否存活或者无效了。
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 什么是TCP Keepalive？</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Keepalive 的概念很简单：当TCP连接建立时，给它设一个定时器，当定时器归零时，发送keepalive探测包。这个包不含数据，并且打开了ACK标记，TCP协议规定了这样的包是合法的，对端会回复一个无数据，设置了ACK的包，这都不需要对端支持Keepalive，就可以完成。
</p>

<p>
如果探测包有回复，说明对端是活的。TCP协议面向流，而不是数据包，这样零长度的数据包对应用是无害的。
</p>

<p>
如果没有回复，说明连接丢失（可能因为重启），应用将发现连接损坏，这过程不需要实际的数据传输。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 为什么使用TCP Keepalive？</h3>
<div class="outline-text-3" id="text-2-2">
<p>
多数情况下，Keepalive是非侵入式的，如果不相信，可以打开它，而不用担心有犯错的风险。但是，它的确产生了额外的网络流量，这可能对路由器和防火墙有点影响。
</p>

<p>
简言之，自己决定，小心行事。
</p>

<p>
下一节，我们将区别Keepalive的两个目的：
</p>
<ul class="org-ul">
<li>检查无效的对端
</li>
<li>防止网络不活跃导致连接断开
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 检查无效连接</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Keepalive可以用来发现对端失效（在对端告诉你它失效前）。多种原因可能导致这种情况，例如内核panic或者野蛮的结束程序（备注：如果只是kill -9进程并不会导致失效的连接，操作系统关闭socket文件描述符时，会通知对端连接关闭，但是强行关闭主机电源会导致对端收不到连接关闭通知，在对端造成无效连接。）另一种你需要检测对端失效的场景是，对端正常，但是连接两端的中间设备出了问题。
</p>

<p>
考虑一个简单的TCP连接，A和B是连接的两端。通过三次握手，A发送SYNC给B，B回复SYNC/ACK给A，最后A回复ACK给B，此时连接建立，可以发送数据了。假如此时，拔掉B的电源，它会立即宕机，没有机会通知A连接断开了。假如A，此时正准备从B接受数据，它没办法知道B宕了。当B恢复时，A以为它和B仍处于连接状态，但B却不知道。只有当A试图往B发送数据，B回复RST时，A才知道连接失效了。
</p>

<p>
Keepalive可以用来发现对端不可达，虽然有假阳性的风险。事实上，如果中间网络出了问题，在标记连接失效前，会间隔性的重试。
</p>

<div class="org-src-container">

<pre class="src src-ditta"> _____                                                 _____
|     |                                               |     |
|  A  |                                               |  B  |
|_____|                                               |_____|
   ^                                                     ^
   |-----&gt;-----&gt;----&gt;------- SYN ------&gt;----&gt;---&gt;--------|
   |-----&lt;-----&lt;----&lt;----- SYN/ACK ------&lt;----&lt;---&lt;------|
   |-----&gt;-----&gt;----&gt;------- ACK ------&gt;----&gt;---&gt;--------|
   |                                   system crash ---&gt; X
   |
   |                                 system restart ---&gt; ^
   |-----&gt;-----&gt;----&gt;------- PUSH -----&gt;----&gt;---&gt;--------|
   |-----&lt;-----&lt;----&lt;------- RST  -----&lt;----&lt;---&lt;------- |
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 防止网络不活跃导致连接断开</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Keepalive的另一种用途是防止不活跃的连接被断开。当使用NAT或者防火墙时，连接被莫名其妙的断开，经常发生。这种现象是NAT 代理和防火墙的连接跟踪机制导致的。代理和防火墙跟踪所有通过它们的连接，受硬件限制，它们只能同时跟踪有限的连接，常用的策略是，保留最新的连接，丢弃很久不活跃的连接。
</p>

<p>
回到刚才的例子，连接建立后，需要等待事件发生，然后和对端通信，如果事件迟迟没有发生会怎样？我们的连接有自己的周期，但是代理并不知道，所以当我们最终发送数据时，连接可能已经从代理移除了，此时连接失效。
</p>

<p>
代理的通常实现是，把连接放到一个队列里，如果连接有数据传递，就把它挪到队首，当（资源有限）需要移除一个连接时，从队尾删除。所以，周期性的发包，可以保证连接不时的往队首挪，最小化连接被删除的风险。
</p>

<div class="org-src-container">

<pre class="src src-ditta"> _____           _____                                     _____
|     |         |     |                                   |     |
|  A  |         | NAT |                                   |  B  |
|_____|         |_____|                                   |_____|
   ^               ^                                         ^
   |---&gt;---&gt;---&gt;---|----------- SYN -------------&gt;---&gt;---&gt;---|
   |---&lt;---&lt;---&lt;---|--------- SYN/ACK -----------&lt;---&lt;---&lt;---|
   |---&gt;---&gt;---&gt;---|----------- ACK -------------&gt;---&gt;---&gt;---|
   |               |                                         |
   |               | &lt;--- connection deleted from table      |
   |               |                                         |
   |---&gt;- PSH -&gt;---| &lt;--- invalid connection                 |
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Linux 下如何使用TCP Keepalive</h2>
<div class="outline-text-2" id="text-3">
<p>
Linux 自身支持Keepalive，可以通过procfs或sysctl接口配置相关参数。
</p>

<p>
Keepalive和三个变量有关
</p>
<ul class="org-ul">
<li><b><code>tcp_keepalive_time</code></b>
  最后一个数据包（ACK不算）发送后多久，开始发Keepalive探测包，一旦某个连接开始发Keepalive探测包，这个计时器就不再有用了。
</li>
<li><b><code>tcp_keepalive_intvl</code></b>
  Keepalive 探测包的发送间隔，不受链接发送正常数据包的影响。
</li>
<li><b><code>tcp_keepalive_prob</code></b>
  连续多少个Keepalive 探测包发送失败，才标记连接失效，并通知应用层。
</li>
</ul>

<p>
即使配置了这些内核参数，Linux默认Keepalive仍是禁用的，你需要通过API开启。相对而言，实现Keepalive的程序并不多（备注：很多是通过超时来防止失效的连接），但是，仍然可以通过（下文描述）一些方法开开启Keepalive支持。
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 配置内核</h3>
<div class="outline-text-3" id="text-3-1">
<p>
有两种用户态命令可以用来配置内核的keepalive参数
</p>
<ul class="org-ul">
<li><b>procfs</b> 接口
</li>
<li><b>sysctl</b> 接口
</li>
</ul>
<p>
我们主要讨论如何使用 <b>procfs</b> 完成这一任务，这时最常见的，容易理解的，推荐的方法。 <b>sysctl</b> 接口是 <b>sysctl</b> (2)系统调用，而不是 <b>sysctl</b> (8)系统工具（后者不是通过前者实现的）。
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> <b>procfs</b> 接口</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
这个接口需要sysctl和procfs，procfs挂载在某个文件系统目录下（通常是/proc）。你可以通过cat /proc/sys/net/ipv4下的文件来查看参数的值。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">cat /proc/sys/net/ipv4/tcp_keepalive_time</span>
7200
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">cat /proc/sys/net/ipv4/tcp_keepalive_intvl</span>
75
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">cat /proc/sys/net/ipv4/tcp_keepalive_probes</span>
9
</pre>
</div>

<p>
头两个参数值单位是秒，第三个是单纯的数字，这意味着keepalive要等2个小时（7200秒）才开始发送第一个探测包，以后每隔75秒就再发一个，如果连续9次，探测包都没收到应答（ACK），这个连接被标记为失效。
</p>

<p>
修改参数的方式很直观，直接往文件中写入值即可。假如你想在没有数据传送后10分钟发送探测包，并且之后，每1分钟发送一个，因为网络较差，希望连续20次探测失败才把连接标记为失效。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">echo 600 &gt; /proc/sys/net/ipv4/tcp_keepalive_time</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">echo 60 &gt; /proc/sys/net/ipv4/tcp_keepalive_intvl</span>
<span style="color: #ff0000;"># </span><span style="color: #ff0000;">echo 20 &gt; /proc/sys/net/ipv4/tcp_keepalive_probes</span>
</pre>
</div>

<p>
可以查看它们的新值，看是否修改成功。
</p>

<p>
主意： <b>procfs</b> 是特殊文件，你不能对它们做任意操作，它们仅仅是内核空间的接口形式，不是真正的文件。测试相关脚本，并只用上面描述的简单的方法访问它们。
</p>

<p>
也可以通过 sysctl(8) 工具来查看和修改。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">sysctl net.ipv4.tcp_keepalive_time net.ipv4.tcp_keepalive_intvl net.ipv4.tcp_keepalive_probes</span>
net.ipv4.tcp_keepalive_time = 7200
net.ipv4.tcp_keepalive_intvl = 75
net.ipv4.tcp_keepalive_probes = 9
</pre>
</div>

<p>
<b>sysctl</b> 和 <b>procfs</b> 的命名方式很像，通过 sysctl(8) 的-w 参数修改它们。
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff0000;"># </span><span style="color: #ff0000;">sysctl -w net.ipv4.tcp_keepalive_time=600 net.ipv4.tcp_keepalive_intvl=60 net.ipv4.tcp_keepalive_probes=20</span>
net.ipv4.tcp_keepalive_time = 600
net.ipv4.tcp_keepalive_intvl = 60
net.ipv4.tcp_keepalive_probes = 20
</pre>
</div>

<p>
注意，*sysctl* (8) 并没有使用 <code>sysctl</code> (2) 系统调用，它是直接操作了 <code>procfs</code> 下的文件， <b>sysctl</b> (8) 只是 <code>procfs</code>  的简单封装而已。
</p>
</div>
</div>
