translational/tcp-keepalive-howto.org
*** ~sysctl~ 接口
~sysctl~ (2) 是另一种操作内核变量的方法，在 ~procfs~ 不可用时，通过 ~sysctl~ (2) 可以直接和内核通讯而不需要 ~procfs~ 。目前没有工具封装了这个系统调用。

可以通过 ~man 2 sysctl~ 查看更多细节。

** 使修改持久化
当系统重启时，上面做的修改会丢失。为了使修改持久化，需要在重启时，重新配置。每个Linux发行版的 *init* (8) 都有一套自己的init脚本机制，它们一般放在 ~/etc/rc.d~ ，或别的什么地方。任何时候，你都可以在启动脚本中设置这些参数。即使已经建立的连接，都可以使用新配置的值。

可以把他们放在 ~/etc/rc.local~ 里，或者参考 ~sysctl~ (8)，把配置放到 ~/etc/sysctl.conf~ 中，系统启动时，会加载里面的配置。平时，可以修改 ~/etc/sysctl.conf~ ，然后用 ~sysctl -p /etc/sysctl.conf~ 使其生效。可以通过 ~man 5 sysctl.conf~ 查看其配置格式。

* 应用编程
本节讲述如何在应用中启用keepalive，需要你懂C语言，基本的网络知识，套接字。

** 何时需要keepalive支持
并不是所有的网络程序都需要keepalive支持的（备注：一般长期运行的长连接服务端程序才需要）。因为是TCP keepalive，所以只有TCP套接字才可以用（备注：其它也不需要）。

可以通过编译选项或者启动选项，让用户选择是否启用keepalive。

** ~setsockopt~ 函数调用
通过设置套接字选项来启用keepalive，函数原型是

#+BEGIN_SRC js
int setsockopt(int s, int level, int optname, const void *optval, socklen_t optlen);
#+END_SRC

第一个参数是套接字，通过 ~socket~ (2)创建的，第二个参数必须是 ~SOL_SOCKET~ ，第三个参数必须是 ~SO_KEEPALIVE~ ，第四个参数是整数表示的boolean值，最后一个参数是整数的大小。

函数返回0表示成功，-1表示失败，通过errno查看失败原因。

还有其它三个和keepalive有关的选项可以设置，使用 ~SOL_TCP~ 替换 ~SOL_SOCKET~ ，它们会覆盖相应的系统设置。
- =TCP_KEEPCNT= 覆盖 ~tcp_keepalive_probes~
- =TCP_KEEPIDLE= 覆盖 ~tcp_keepalive_time~
- =TCP_KEEPINTVL= 覆盖 ~tcp_keepalive_intvl~

** 实例代码

#+BEGIN_SRC js :exports code :main
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <sys/types.h>
#include <sys/socket.h>
#include <netinet/in.h>

int main()
{
   int s;
   int optval;
   socklen_t optlen = sizeof(optval);

   /* Create the socket */
   if((s = socket(PF_INET, SOCK_STREAM, IPPROTO_TCP)) < 0) {
      perror("socket()");
      exit(EXIT_FAILURE);
   }

   /* Check the status for the keepalive option */
   if(getsockopt(s, SOL_SOCKET, SO_KEEPALIVE, &optval, &optlen) < 0) {
      perror("getsockopt()");
      close(s);
      exit(EXIT_FAILURE);
   }
   printf("SO_KEEPALIVE is %s\n", (optval ? "ON" : "OFF"));

   /* Set the option active */
   optval = 1;
   optlen = sizeof(optval);
   if(setsockopt(s, SOL_SOCKET, SO_KEEPALIVE, &optval, optlen) < 0) {
      perror("setsockopt()");
      close(s);
      exit(EXIT_FAILURE);
   }
   printf("SO_KEEPALIVE set on socket\n");

   /* Check the status again */
   if(getsockopt(s, SOL_SOCKET, SO_KEEPALIVE, &optval, &optlen) < 0) {
      perror("getsockopt()");
      close(s);
      exit(EXIT_FAILURE);
   }
   printf("SO_KEEPALIVE is %s\n", (optval ? "ON" : "OFF"));

   close(s);

   exit(EXIT_SUCCESS);
}

#+END_SRC

* 给第三方软件添加keepalive支持
不是所有的软件都支持keepalive，因为Linux不支持在系统级别开启keepalive支持，唯一方法实在创建套接字后执行 ~setsockopt~ (2)调用，所以如果想支持keepalive，只有两种办法：
- 修改源码
- 使用PRELOAD，注入 ~setsockopt~ (2)

** 修改源码
需要修改所有套接字创建的地方，第一处是 ~socket~ (2)，它创建套接字，只用修改那些创建TCP套接字，并且第二个参数是 ~SOCK_STREAM~ 的调用。第二处是 ~accept~ (2)。

找到相关套接字后，添加相应的 ~setsockopt~ (2)调用即可。

