blogs/tcp-keepalive-howto.html

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> <code>sysctl</code> 接口</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<code>sysctl</code> (2) 是另一种操作内核变量的方法，在 <code>procfs</code> 不可用时，通过 <code>sysctl</code> (2) 可以直接和内核通讯而不需要 <code>procfs</code> 。目前没有工具封装了这个系统调用。
</p>

<p>
可以通过 <code>man 2 sysctl</code> 查看更多细节。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 使修改持久化</h3>
<div class="outline-text-3" id="text-3-2">
<p>
当系统重启时，上面做的修改会丢失。为了使修改持久化，需要在重启时，重新配置。每个Linux发行版的 <b>init</b> (8) 都有一套自己的init脚本机制，它们一般放在 <code>/etc/rc.d</code> ，或别的什么地方。任何时候，你都可以在启动脚本中设置这些参数。即使已经建立的连接，都可以使用新配置的值。
</p>

<p>
可以把他们放在 <code>/etc/rc.local</code> 里，或者参考 <code>sysctl</code> (8)，把配置放到 <code>/etc/sysctl.conf</code> 中，系统启动时，会加载里面的配置。平时，可以修改 <code>/etc/sysctl.conf</code> ，然后用 <code>sysctl -p /etc/sysctl.conf</code> 使其生效。可以通过 <code>man 5 sysctl.conf</code> 查看其配置格式。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 应用编程</h2>
<div class="outline-text-2" id="text-4">
<p>
本节讲述如何在应用中启用keepalive，需要你懂C语言，基本的网络知识，套接字。
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 何时需要keepalive支持</h3>
<div class="outline-text-3" id="text-4-1">
<p>
并不是所有的网络程序都需要keepalive支持的（备注：一般长期运行的长连接服务端程序才需要）。因为是TCP keepalive，所以只有TCP套接字才可以用（备注：其它也不需要）。
</p>

<p>
可以通过编译选项或者启动选项，让用户选择是否启用keepalive。
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <code>setsockopt</code> 函数调用</h3>
<div class="outline-text-3" id="text-4-2">
<p>
通过设置套接字选项来启用keepalive，函数原型是
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #00ff00;">int</span> <span style="color: #ffff00;">setsockopt</span><span style="color: #707183;">(</span><span style="color: #00ff00;">int</span> <span style="color: #ffff00;">s</span>, <span style="color: #00ff00;">int</span> level, <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">optname</span>, <span style="color: #00ffff; font-weight: bold;">const</span> <span style="color: #00ffff; font-weight: bold;">void</span> *optval, socklen_t optlen<span style="color: #707183;">)</span>;
</pre>
</div>

<p>
第一个参数是套接字，通过 <code>socket</code> (2)创建的，第二个参数必须是 <code>SOL_SOCKET</code> ，第三个参数必须是 <code>SO_KEEPALIVE</code> ，第四个参数是整数表示的boolean值，最后一个参数是整数的大小。
</p>

<p>
函数返回0表示成功，-1表示失败，通过errno查看失败原因。
</p>

<p>
还有其它三个和keepalive有关的选项可以设置，使用 <code>SOL_TCP</code> 替换 <code>SOL_SOCKET</code> ，它们会覆盖相应的系统设置。
</p>
<ul class="org-ul">
<li><code>TCP_KEEPCNT</code> 覆盖 <code>tcp_keepalive_probes</code>
</li>
<li><code>TCP_KEEPIDLE</code> 覆盖 <code>tcp_keepalive_time</code>
</li>
<li><code>TCP_KEEPINTVL</code> 覆盖 <code>tcp_keepalive_intvl</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 实例代码</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;stdio.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;stdlib.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;unistd.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;sys/types.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;sys/socket.h&gt;</span>
<span style="color: #0000ff; font-weight: bold;">#include</span> <span style="color: #00ff00;">&lt;netinet/in.h&gt;</span>

<span style="color: #00ff00;">int</span> <span style="color: #ffff00;">main</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
   <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">s</span>;
   <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">optval</span>;
   socklen_t optlen = sizeof<span style="color: #7388d6;">(</span>optval<span style="color: #7388d6;">)</span>;

   <span style="color: #ff0000;">/* </span><span style="color: #ff0000;">Create the socket */</span>
   <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>s = socket<span style="color: #709870;">(</span>PF_INET, SOCK_STREAM, IPPROTO_TCP<span style="color: #709870;">)</span><span style="color: #909183;">)</span> &lt; 0<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
      perror<span style="color: #909183;">(</span><span style="color: #00ff00;">"socket()"</span><span style="color: #909183;">)</span>;
      exit<span style="color: #909183;">(</span>EXIT_FAILURE<span style="color: #909183;">)</span>;
   <span style="color: #7388d6;">}</span>

   <span style="color: #ff0000;">/* </span><span style="color: #ff0000;">Check the status for the keepalive option */</span>
   <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>getsockopt<span style="color: #909183;">(</span>s, SOL_SOCKET, SO_KEEPALIVE, &amp;optval, &amp;optlen<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
      perror<span style="color: #909183;">(</span><span style="color: #00ff00;">"getsockopt()"</span><span style="color: #909183;">)</span>;
      close<span style="color: #909183;">(</span>s<span style="color: #909183;">)</span>;
      exit<span style="color: #909183;">(</span>EXIT_FAILURE<span style="color: #909183;">)</span>;
   <span style="color: #7388d6;">}</span>
   printf<span style="color: #7388d6;">(</span><span style="color: #00ff00;">"SO_KEEPALIVE is %s\n"</span>, <span style="color: #909183;">(</span>optval ? <span style="color: #00ff00;">"ON"</span> : <span style="color: #00ff00;">"OFF"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;

   <span style="color: #ff0000;">/* </span><span style="color: #ff0000;">Set the option active */</span>
   optval = 1;
   optlen = sizeof<span style="color: #7388d6;">(</span>optval<span style="color: #7388d6;">)</span>;
   <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>setsockopt<span style="color: #909183;">(</span>s, SOL_SOCKET, SO_KEEPALIVE, &amp;optval, optlen<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
      perror<span style="color: #909183;">(</span><span style="color: #00ff00;">"setsockopt()"</span><span style="color: #909183;">)</span>;
      close<span style="color: #909183;">(</span>s<span style="color: #909183;">)</span>;
      exit<span style="color: #909183;">(</span>EXIT_FAILURE<span style="color: #909183;">)</span>;
   <span style="color: #7388d6;">}</span>
   printf<span style="color: #7388d6;">(</span><span style="color: #00ff00;">"SO_KEEPALIVE set on socket\n"</span><span style="color: #7388d6;">)</span>;

   <span style="color: #ff0000;">/* </span><span style="color: #ff0000;">Check the status again */</span>
   <span style="color: #00ffff; font-weight: bold;">if</span><span style="color: #7388d6;">(</span>getsockopt<span style="color: #909183;">(</span>s, SOL_SOCKET, SO_KEEPALIVE, &amp;optval, &amp;optlen<span style="color: #909183;">)</span> &lt; 0<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
      perror<span style="color: #909183;">(</span><span style="color: #00ff00;">"getsockopt()"</span><span style="color: #909183;">)</span>;
      close<span style="color: #909183;">(</span>s<span style="color: #909183;">)</span>;
      exit<span style="color: #909183;">(</span>EXIT_FAILURE<span style="color: #909183;">)</span>;
   <span style="color: #7388d6;">}</span>
   printf<span style="color: #7388d6;">(</span><span style="color: #00ff00;">"SO_KEEPALIVE is %s\n"</span>, <span style="color: #909183;">(</span>optval ? <span style="color: #00ff00;">"ON"</span> : <span style="color: #00ff00;">"OFF"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>;

   close<span style="color: #7388d6;">(</span>s<span style="color: #7388d6;">)</span>;

   exit<span style="color: #7388d6;">(</span>EXIT_SUCCESS<span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 给第三方软件添加keepalive支持</h2>
<div class="outline-text-2" id="text-5">
<p>
不是所有的软件都支持keepalive，因为Linux不支持在系统级别开启keepalive支持，唯一方法实在创建套接字后执行 <code>setsockopt</code> (2)调用，所以如果想支持keepalive，只有两种办法：
</p>
<ul class="org-ul">
<li>修改源码
</li>
<li>使用PRELOAD，注入 <code>setsockopt</code> (2)
</li>
</ul>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 修改源码</h3>
<div class="outline-text-3" id="text-5-1">
<p>
需要修改所有套接字创建的地方，第一处是 <code>socket</code> (2)，它创建套接字，只用修改那些创建TCP套接字，并且第二个参数是 <code>SOCK_STREAM</code> 的调用。第二处是 <code>accept</code> (2)。
</p>

<p>
找到相关套接字后，添加相应的 <code>setsockopt</code> (2)调用即可。
</p>
</div>
</div>
